tutorials/compressible/nexaFoam/neTCLib/shockTube/0/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1706                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      initialConditions;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Right side - left is initialized with setFields
TTRValue  278.7;
TVibValue 278.7;

pressureValue  10000;

velocityValue  (0 0 0);

N2_mol_fraction 1;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
